Repository: Tawan-Phumphom/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement_vpncui.po
Languages: th

source: Error decrypting the obfuscated password
th: การถอดรหัสผิดพลาด

source: Error
th: ข้อผิดพลาด

source: NetworkManager is missing support for Cisco Compatible VPN
th: NetworkManager ขาดการรับรองสำหรับ VPN ที่ใช้งานได้กับ Cisco

source: %1: file could not be created
th: %1: ไม่สามารถสร้างไฟล์ได้

source: Gateway:
th: เกตเวย์:

source: IP/hostname of IPsec gateway.
th: IP/โฮสต์เนมของเกตเวย์ IPsec

source: User name:
th: ชื่อผู้ใช้:

source: User name for the connection.
th: ชื่อผู้ใช้สำหรับการเชื่อมต่อ

source: User password:
th: รหัสผ่านผู้ใช้:

source: User password for the connection.
th: รหัสผ่านผู้ใช้สำหรับการเชื่อมต่อ

source: Group name:
th: ชื่อกลุ่ม:

source: Group name
th: ชื่อกลุ่ม

source: Group password:
th: รหัสผ่านกลุ่ม:

source: Group password.
th: รหัสผ่านกลุ่ม

source: Enable hybrid authentication, i.e. use certificate in addition to password.
th: เปิดการตรวจสอบสิทธิแบบไฮบริด เช่น ใช้ใบรับรองพร้อมกับรหัสผ่าน

source: Use hybrid authentication
th: การรับรองความถูกต้องแบบไฮบริด

source: CA file:
th: ไฟล์ CA:

source: CA certificate in PEM format.
th: ใบรับรอง CA ในฟอร์แม็ต PEM

source: Advanced…
th: ขั้นสูง…

source: Identification
th: การแสดงตัว:

source: Domain:
th: โดเมน:

source: (NT-)Domain name for authentication.
th: ชื่อ (NT-)โดเมน สำหรับการพิสูจน์ตัวตน

source: Vendor:
th: ผู้ผลิต:

source: Vendor of your IPsec gateway.
th: ผู้ผลิต IPsec เกตเวย์ของคุณ

source: Transport and Security
th: การรับส่งข้อมูลและความปลอดภัย

source: Encryption method:
th: วิธีการเข้ารหัส:

source: Encryption method.
th: วิธีการเข้ารหัส

source: NAT traversal:
th: การส่งผ่าน NAT:

source: NAT traversal method to use.
th: วิธีการส่งผ่าน NAT ที่จะใช้

source: IKE DH Group:
th: กลุ่ม IKE DH:

source: Name of the IKE DH group.
th: ชื่อของกลุ่ม IKE DH

source: Perfect Forward Secrecy:
th: การส่งต่อความลับที่สมบูรณ์แบบ (PFS):

source: Diffie-Hellman group to use for PFS.
th: กลุ่ม Diffie-Hellman ที่จะใช้สำหรับ PFS

source: Local Port:
th: พอร์ตภายในระบบ:

source: Local port to use (0-65535). 0 (default value) means random port. 500 is vpnc's default.
th: พอร์ตภายในระบบที่จะใช้งาน (0-65536) ค่าเริ่มต้น (0) จะเป็นการสุ่มตัวเลข 500 เป็นค่าเริ่มต้นของ vpnc

source: Random
th: สุ่ม

source: Disable sending DPD packets (set timeout to 0).
th: ปิดการส่งแพ็กเก็ต DPD (ตั้งเวลาหมดเป็น 0)

source: Disable dead peer detection
th: ปิดการตรวจจับเพียร์ที่ตายไปแล้ว

source: Advanced VPNC properties
th: คุณสมบัติ VPNC ขั้นสูง

# VPNC encryption method
source: Secure (default)
th: ปลอดภัย (ค่าเริ่มต้น)

# VPNC encryption method
source: Weak (DES encryption, use with caution)
th: อ่อนแอ (การเข้ารหัส DES ใช้อย่างระมัดระวัง)

# VPNC encryption method
source: None (completely insecure)
th: ไม่มี (ไม่ปลอดภัย)

# NAT traversal method
source: NAT-T when available (default)
th: NAT-T ถ้ามี (ค่าเริ่มต้น_

# NAT traversal method
source: NAT-T always
th: NAT-T ตลอดไป

# NAT traversal method
source: Disabled
th: ปิดการใช้งาน

# IKE DH group
source: DH Group 1
th: กลุ่ม DH 1

# IKE DH group
source: DH Group 2 (default)
th: กลุ่ม DH 2 (ค่าเริ่มต้น)

# IKE DH group
source: DH Group 5
th: กลุ่ม DH 5

# Perfect Forward Secrecy
source: Server (default)
th: เซิร์ฟเวอร์ (ค่าเริ่มต้น)

# Perfect Forward Secrecy
source: None
th: ไม่มี

# Perfect Forward Secrecy
source: DH Group 1
th: กลุ่ม DH 1

# Perfect Forward Secrecy
source: DH Group 2
th: กลุ่ม DH 2

# Perfect Forward Secrecy
source: DH Group 5
th: กลุ่ม DH 5

source: User Password:
th: รหัสผ่านผู้ใช้:

source: Group Password:
th: รหัสผ่านกลุ่ม:

source: Username:
th: ชื่อผู้ใช้:

source: Group name.
th: ชื่อกลุ่ม
