Repository: Tawan-Phumphom/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement_l2tpui.po
Languages: th

source: Gateway:
th: เกตเวย์:

source: L2TP server IP or name.
th: ชื่อหรือ IP SSLVPN

source: Authentication type:
th: ชนิดการรับรองความถูกต้อง:

source: Select an authentication mode.
th: เลือกโหมดการรับรองความถูกต้อง

source: Password
th: รหัสผ่าน

source: Certificates (TLS)
th: ใบรังรอง TLS

# like in Username for athentication
source: Username:
th: ชื่อผู้ใช้:

source: <html><head/><body><p>Set the name used for authenticating the local system to the peer to &lt;name&gt;.</p></body></html>
th: <html><head/><body><p>ใส่ชื่อสำหรับการการพิสูจน์ตัวตนไปยังเพียร์ &lt;name&gt;.</p></body></html>

source: Password:
th: รหัสผ่าน

source: <html><head/><body><p>Password passed to PPPD when prompted for it.</p></body></html>
th: <html><head/><body><p>รหัสผ่านที่ส่งไปยัง SSLVPN เมื่อถูกขอ:</p></body></html>

source: NT Domain:
th: โดเมน NT:

source: <html><head/><body><p>Append the domain name &lt;domain&gt; to the local host name for</p><p>authentication purposes.</p></body></html>
th: <html><head/><body><p>ใช่ชื่อโดเมน &lt;domain&gt; ไปที่ชื่อเครื่อง localhost เพื่อ</p><p>การรับรองความถูกต้อง</p></body></html>

source: CA Certificate:
th: ใบรับรอง CA:

source: <html><head/><body><p>Certificate authority (CA) file in .pem, .der, .crt, .cer or .p12 formats.</p></body></html>
th: <html><head/><body><p>ไฟล์ใบรับรอง CA เป็นฟอร์แมต .pem .der .crt .cer หรือ .p12</p></body></html>

source: User Certificate:
th: ใบรับรองผู้ใช้:

source: <html><head/><body><p>Certificate in .pem, .der, .crt, .cer or .p12 formats.</p></body></html>
th: <html><head/><body><p>ใบรับรองเป็นฟอร์แมต .pem .der .crt .cer หรือ .p12</p></body></html>

source: Private Key:
th: กุญแจส่วนตัว:

source: <html><head/><body><p>Private key in .pem, .der, .key, .pk8 or .p12 formats.</p></body></html>
th: <html><head/><body><p>กุญแจส่วนตัวเป็นฟอร์แมต .pem .der .key .pk8 หรือ .p12</p></body></html>

source: Private Key Password:
th: รหัสผ่านกุญแจส่วนตัว:

source: <html><head/><body><p>Password for private key or PKCS#12 certificate.</p></body></html>
th: <html><head/><body><p>รหัสผ่านสำหรับกุญแจส่วนตัวหรือใบรับรอง PKCS#12</p></body></html>

source: IPsec Settings…
th: การตั้งค่า IPsec...

source: PPP Settings…
th: การตั้งค่า PPP...

source: User Password:
th: รหัสผ่านผู้ใช้:

source: User Certificate Password:
th: รหัสผ่านใบรับรองผู้ใช้:

source: Machine Certificate Password:
th: รหัสผ่านใบรับรองของเครื่อง:

source: Enable IPsec tunnel to L2TP host
th: เปิดทันเนล IPsec ไปยังโฮสต์ L2TP

source: Machine Authentication
th: การรับรองความถูกต้องเครื่อง

source: Type:
th: ชนิด:

source: Pre-shared Key (PSK)
th: กุญแจที่แลกเปลี่ยนล่วงหน้า (PSK)

source: Pre-shared Key:
th: กุญแจที่แลกเปลี่ยนล่วงหน้า (PSK):

source: <html><head/><body><p>Pre-shared key (PSK) secret.</p></body></html>
th: <html><head/><body><p>รหัสลับกุญแจที่แลกเปลี่ยนล่วงหน้า</p></body></html>

source: Machine Certificate:
th: รับรองของเครื่อง:

source: <html><head/><body><p>Certificate in .pem, .der or .p12 formats.</p></body></html>
th: <html><head/><body><p>ใบรับรองฟอร์แมต .pem .der หรือ .p12</p></body></html>

source: Advanced
th: ขั้นสูง

source: Phase1 Algorithms:
th: อัลกอริทึม Phase1:

source: Phase2 Algorithms:
th: อัลกอริทึม Phase2:

source: <html><head/><body><p>Optional. A list of proposals for ESP - Quick Mode. The format is “enc-integ,enc-integ, …”.</p></body></html>
th: <html><head/><body><p>ไม่บังคับ รายการข้อเสนอสำหรับ ESP - Quick Mode ฟอร์แมตคือ “enc-integ,enc-integ, …”.</p></body></html>

source: <html><head/><body><p>How long the keying channel of a connection should last before being renegotiated.</p></body></html>
th: <html><head/><body><p>การใช้ช่องกุญแจ (keying channel) สำหรับแต่ละการเชื่อมต่อควรจะนานเท่าไหร่ก่อนที่จะโดนการเจรจาใหม่ (re-negotiation)</p></body></html>

source: Phase1 Lifetime:
th: อายุการใช้งาน Phase1:

source: <html><head/><body><p>Optional. A list of proposals for IKE - Main Mode. The format is “enc-integ-group,enc-integ-group, …”.</p></body></html>
th: <html><head/><body><p>ไม่บังคับ รายการข้อเสนอสำหรับ IKE - Main Mode ฟอร์แมตคือ “enc-integ-group,enc-integ-group, …”</p></body></html>

source: Phase2 Lifetime:
th: อายุการใช้งาน Phase2:

source: <html><head/><body><p>How long a particular instance of a connection (a set of encryption/authentication keys for user packets) should last, from successful negotiation to expiry.</p></body></html>
th: <html><head/><body><p>การเชื่อมต่อในแต่ละครั้ง (เป็นเซ็ตแพ็คเก็ตผู้ใช้ที่เป็นกุญแจเข้ารหัสและพิสูจน์ตัวตน) ควรจะนานเท่าไหร จากการเจรจา (negotiation) ไปยังการหมดอายุ</p></body></html>

source: <html><head/><body><p>Optional. How the IPsec server should be identified for authentication. Sometimes referred to as Peer ID or Gateway ID, also referred to as rightid by strongSwan, Libreswan, Openswan and FreeS/WAN. See strongSwan or Libreswan documentation for leftid/rightid syntax and identity parsing.</p></body></html>
th: <html><head/><body><p>ไม่บังคับ เซิร์ฟเวอร์ IPsec ควรจะระบุตัวตนอย่างไรสำหรับการรับรองความถูกต้อง อาจถูกเรียกว่าเป็นรหัสเพียร์ (Peer ID) หรือรหัสเกตเวย์ (Gateway ID) และถูกเรียกว่า "rightid" โดย strongSwan Libreswan Openswan และ FreeS/WAN กรุณาไปอ่านคู่มือเอกสาร strongSwan หรือ Libreswan สำหรับไวยากรณ์ leftid/rightid และการวจีวิภาคตัวตน</p></body></html>

source: <html><head/><body><p>IPComp compresses raw IP packets before they get encrypted. This saves some bandwidth, but uses more processing power.</p></body></html>
th: <html><head/><body><p>IPComp บีบอัดแพ็คเก็ตดิบก่อนที่จะเข้ารหัส ตัวเลือกนี้ช่วยให้ใช้อินเทอร์เน็ตน้อยลงแต่ใช้พลังประมวลผลมากขึ้น</p></body></html>

source: Use IP compression
th: ใช้การบีบอัด IP

source: <html><head/><body><p>Disable perfect forward secrecy. Enable this option only if the server doesn’t support PFS.</p></body></html>
th: <html><head/><body><p>ปิดการส่งต่อความลับที่สมบูรณ์แบบ (perfect forward secrecy) ใช้ตัวเลือกนี้ถ้าหากเซิร์ฟเวอร์ปลายทางไม่รองรับ PFS เท่านั้น</p></body></html>

source: Disable PFS
th: ปิด PFS

source: <html><head/><body><p>Some firewalls block ESP traffic. Enforcing UDP encapsulation even if no NAT situation is detected might help in such cases.</p></body></html>
th: <html><head/><body><p>ไฟวอลล์บางตัวกั้น ESP การบังคับการใช้งานการห่อหุ้ม UDP (encapsulation) แม้ว่าไม่สามารถตรวจพบ NAT อาจช่วยได้ในที่นี้</p></body></html>

source: Enforce UDP encapsulation
th: บังคับใช้การห่อหุ้ม UDP (encapsulation)

source: Remote ID:
th: ID ริโมต:

source: L2TP IPsec Options
th: ตัวเลือก L2TP IPsec

source: Authentication
th: การรับรองความถูกต้อง

source: Allow following authentication methods:
th: อนุญาตให้ใช้วิธีการการรับรองความถูกต้องดังนี้:

source: Allow/disable authentication methods
th: อนุญาต/ปิดวิธีการการรับรองความถูกต้องดังนี้

source: Compression
th: การบีบอัด

source: Allow/disable BSD-Compress compression.
th: อนุญาต/ปิดการบีบอัดแบบ BSD

source: Allow BSD compression
th: อนุญาตให้ใช้การบีบอัดแบบ BSD

source: Allow/disable Deflate compression.
th: อนุญาต/ปิดการบีบอัดแบบ Deflate

source: Allow Deflate compression
th: อนุญาตให้ใช้การบีบอัดแบบ Deflate

source: Allow/disable Van Jacobson style TCP/IP header compression in both the transmit and the receive directions.
th: อนุญาตให้ใช้การบีบอัด TCP/IP header สไตล์ Van Jacobson ทั้งสองทางระหว่างต้นทางและปลายทาง

source: Allow TCP header compression
th: อนุญาตให้ใช้การบีบอัด TCP header

source: Allow protocol field compression negotiation in both the receive and the transmit directions.
th: อนุญาตให้โพรโทคอล field compression negotiation ทั้งสองทางการรับและการส่ง

source: Use protocol field compression negotiation
th: ใช้โพรโทคอล field compression negotitation

source: Use Address/Control compression in both directions (send and receive).
th: ใช้การบีบอัด แอดเดรส/คอนโทร ทั้งสองทาง (ส่งและรับ)

source: Use Address/Control compression
th: ใช้การบีบอัด แอดเดรส/คอนโทร

source: Send LCP echo-requests to find out whether peer is alive.
th: ส่งคำขอ LCP echo-requests เพื่อที่จะหาว่าเพียร์มีชีวิตอยู่

source: Send PPP echo packets
th: ส่งแพ็คเก็ต PPP echo

source: Other Settings
th: การตั้งค่าอื่น ๆ

source: Note: MPPE encryption is only available with MSCHAP authentication methods. To enable this checkbox, select one or more of the MSCHAP authentication methods: MSCHAP or MSCHAPv2.
th: หมายเหตุ: การเข้ารหัสแบบ MPPE ใช้ได้กับวิธีการรับรองความถูกต้อง MSCHAP เท่านั้น ถ้า อยากจะเปิดตัวเลือกนี้ ให้เลือกระหว่างวิธีการรับรองความถูกต้อง MSCHAP ดังนี้: MSCHAP หรือ MSCHAPv2

source: Use MPPE Encryption
th: ใช้การเข้ารหัา MPPE

source: Crypto:
th: การเข้ารหัส:

source: Require the use of MPPE, with 40/128-bit encryption or all.
th: บังคับใช้ MMPE กับการเข้ารหัส 40/128 บิต หรือทั้งหมด

# like in use Any configuration
source: Any
th: อันไหนก็ได้

source: 128 bit
th: 128 บิต

source: 40 bit
th: 40 บิต

source: Allow MPPE to use stateful mode. Stateless mode is still attempted first.
th: อนุญาตให้ MPPE ใช้โหมด stateful แต่โหมด stateless จะถูกใช้งานก่อนอยู่ดี

source: Use stateful encryption
th: ใช้การเข้ารหัส stateful

source: L2TP PPP Options
th: ตัวเลือก L2TP PPP
