Repository: Tawan-Phumphom/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement_sshui.po
Languages: th

source: Use custom gateway port:
th: ใช้พอร์ตเกตเวย์ที่กำหนดเอง:

source: Use custom tunnel Maximum Transmission Unit (MTU):
th: ใช้หน่วยส่งสัญญาณสูงสุด (MTU) ที่กำหนดเอง:

source: Extra SSH options:
th: ตัวเลือก SSH เพิ่มเติม:

source: Remote device number:
th: อุปกรณ์ริโมตหมายเลข

source: Use a TAP device
th: ใช้อุปกรณ์ TAP

source: Remote username
th: ชื่อผู้ใช้ริโมต

source: Do not replace default route
th: อย่าเปลี่ยน route ค่าเริ่มต้น

source: SSH VPN
th: VPN SSH

source: Password:
th: รหัสผ่าน:

source: General
th: ทั่วไป

source: Gateway:
th: เกตเวย์:

source: Network Settings
th: การตั้งค่าเครือข่าย

source: Remote IP Address:
th: ที่อยู่ IP ริโมต:

source: Local IP Address:
th: ที่อยู่ IP เครื่อง:

source: IPv6 Network Settings
th: การตั้งค่าเครือข่าย IPv6

source: Use IPv6
th: ใช้ IPv6

source: Authentication
th: การพิสูจน์ตัวตน

source: Password:
th: รหัสผ่าน:

source: SSH Key File:
th: ไฟล์กุญแจ SSH:

source: Type:
th: ชนิด:

source: Password
th: รหัสผ่าน

source: Key authentication
th: กุญแจการพิสูจน์ตัวตน

source: Advanced…
th: ขั้นสูง…
