Repository: Tawan-Phumphom/kde-l10n-th
Catalog: messages/plasma-nm/plasmanetworkmanagement_openvpnui.po
Languages: th

source: NetworkManager is missing support for OpenVPN
th: NetworkManager ขาดการรับรองการเชื่อมต่อ OpenVPN

source: Error saving file %1: %2
th: บันทึกไฟล์ %1 ผิดพลาด: %2

source: Error copying certificate to %1: %2
th: การคัดลอกไฟล์ใบรับรอง %1 ผิดพลาด: %2

source: Gateway:
th: เกตเวย์:

source: Remote gateways(s), with optional port and protocol (e.g. ovpn.corp.com:1234:tcp). You can specify multiple hosts for redundancy (use commas or spaces as delimiters).
th: เกตเวย์ริโมตที่อาจมีพอร์ตและโพรโทคอลก็ได้ (เช่น opvn.corp.com:1234:tcp) คุณสามารถเลือกโฮสต์หลายตัวเพื่อเพิ่มตัวสำรองได้ (ใช้เครื่องหมายจุลภาคหรือเว้นวรรคเพื่อคั่น)

source: Connection type:
th: ชนิดการเชื่อมต่อ:

source: Select an authentication mode.
th: เลือกโหมดการรับรองความถูกต้อง

source: Certificates (TLS)
th: ใบรังรอง TLS

source: Static Key
th: กุญแจคงที่

source: Password
th: รหัสผ่าน

source: Password with Certificates (TLS)
th: รหัสผ่านที่มีใบรังรอง TLS

source: CA Certificate:
th: ใบรับรอง CA:

source: Certificate authority (CA) file in .pem format.
th: ไฟล์ใบรับรองผู้ใช้ฟอร์แมต .pem

source: User Certificate:
th: ใบรับรองผู้ใช้:

source: Local peer's signed certificate in .pem format (signed by CA of CA Certificate).
th: ใบรับรองเพียร์เครื่องที่ลงนามในฟอร์แมต .pem (ที่ลงนามโดย CA จากใบรับรอง CA)

source: Private Key:
th: กุญแจส่วนตัว:

source: Local peer's private key in .pem format.
th: กุญแจส่วนตัวของเครื่องในฟอร์แมต .pem

source: Private Key Password:
th: รหัสผ่านกุญแจส่วนตัว

source: Password for private key.
th: รหัสผ่านของกุญแจส่วนตัว

source: Static Key:
th: กุญแจคงที่:

source: Pre-shared file for Static Key encryption mode (non-TLS).
th: กุญแจที่แลกเปลี่ยนล่วงหน้า (PSK) สำหรับโหมดเข้ารหัสแบบกุญแจคงที่ (ที่ไม่ใช่ TLS)

source: Key Direction:
th: ทิศทางกุญแจ:

source: Direction for Static Key encryption mode (non-TLS).
th: ทิศทางกุญแจสำหรับโหมดเข้ารหัสแบบกุญแจคงที่ (ที่ไม่ใช่ TLS)

source: If key direction is used, it must be the opposite of that used on the VPN peer.
th: ถ้าหากใช้ตัวเลือกทิศทางกุญแจ ต้องตั้งให้เป็นทิศทางที่ตรงกันข้ามกับที่ใช้ในเพียร์ VPN

# No "Key Direction"
source: None
th: ไม่มี

source: Local IP Address:
th: ที่อยู่ IP เครื่อง:

source: IP address of the remote VPN endpoint.
th: ที่อยู่ IP เครื่องริโมต VPN ปลายทาง

source: Remote IP Address:
th: ที่อยู่ IP ริโมต:

source: IP address of the local VPN endpoint.
th: ที่อยู่ IP เครื่อง VPN ต้นทาง

source: If key direction is used, it must be the opposite of that used on the VPN peer. For example, if the peer uses '1', this connection must use '0'. If you are unsure what value to use, contact your system administrator.
th: ถ้าหากใช้ตัวเลือกทิศทางกุญแจ ต้องตั้งให้เป็นทิศทางที่ตรงกันข้ามกับที่ใช้ในเพียร์ VPN อย่างเช่น ถ้าหากเพียร์ปลายทางใช้ '1' การเชื่อมต่ออันนี้ต้องใช้ '0' ถ้าหากไม่แน่ใจว่าตั้งค่าว่าอะไร ให้ติดต่อผู้ดูแลระบบ

# like in Username for athentication
source: Username:
th: ชื่อผู้ใช้:

source: Username passed to OpenVPN when prompted for it.
th: ชื่อผู้ใช้ที่ส่งไปยัง OpenVPN เมื่อถูกขอ

source: Password:
th: รหัสผ่าน:

source: Password passed to OpenVPN when prompted for it.
th: ชื่อผู้ใช้ที่ส่งไปยัง OpenVPN เมื่อถูกขอ

source: Advanced…
th: ขั้นสูง…

source: General
th: ทั่วไป

source: TCP/UDP port number for peer. (Default value when there is no port for gateway).
th: เลขพอร์ต TCP/UDP สำหรับเพียร์ (ใช้ค่าเริ่มต้นถ้าหากไม่ได้ตั้งพอร์ตสำหรับเกตเวย์)

source: Use custom gateway port:
th: ใช้พอร์ตเกตเวย์ที่กำหนดเอง:

# like in use Automatic configuration
source: Automatic
th: อัตโนมัติ

source: Renegotiate data channel key after the specified number of seconds.
th: negotiate กุญแจช่องข้อมูลใหม่หลังจากเวลาที่กำหนดไว้เป็นวินาที

source: Use custom renegotiation interval:
th: ตั้งค่าระยะเวลาสำหรับการ negotiation ใหม่เอง:

source: Use compression.
th: ใช้การบีบอัด

source: Use compression
th: ใช้การบีบอัด

source: No
th: ไม่ใช้

source: Adaptive
th: เปลี่ยนปรับตัว

source: Automatic
th: อัตโนมัติ

source: Use TCP for communicating with remote host.
th: ใช้ TCP สำหรับสื่อสารกับโฮสต์ริโมต

source: Use a TCP connection
th: ใช้การเชื่อมต่อ TCP

source: Explicitly set virtual device type (TUN/TAP).
th: ตั้งชนิดอุปกรณ์จำลอง (TUN/TAP)

source: Set virtual device type:
th: ตั้งชนิดอุปกรณ์จำลอง:

source: Use custom name for TUN/TAP virtual device (instead of default "tun" or "tap").
th: ใช้ชื่อที่กำหนดเองสำหรับอุปกรณ์ TUN/TAP (แทนค่าเริ่มต้น "tun" หรือ "tap)

source: Set virtual device name:
th: ตั้งชื่ออุปกรณ์จำลอง:

source: Take the TUN device MTU to be specified value and derive the link MTU from it.
th: ตั้งค่า MTU ของอุปกรณ์ TUN ให้เป็นค่าอื่นและใช้ค่า MTU จากค่านี้

source: Use custom tunnel Maximum Transmission Unit (MTU):
th: ใช้ค่าหน่วยส่งสัญญาณสูงสุด (MTU) ที่กำหนดเอง:

source: Enable internal datagram fragmentation with this maximum size.
th: เปิดใช้การแตกแยกเดตาแกรมภายในสำหรับค่าหน่วยสูงสุดนี้

source: Use custom UDP fragment size:
th: ใช้ขนาดแตกแยก UDP ที่กำหนดเอง

source: Restrict tunnel TCP maximum segment size.
th: จำกัดค่าสูงสุดของขนาดส่วน TCP

source: Restrict TCP maximum segment size (MSS)
th: จำกัดค่าสูงสุดของขนาดส่วน TCP (MSS)

source: Randomize the order of gateways list (remote) as a kind of basic load- balancing measure.
th: สุ่มรายการของเกตเวย์ริโมตเพิ่มเป็นการปรับสมดุลการโหลด

source: Randomize remote hosts
th: สุ่มโฮสต์ริโมต

source: Build a tun link capable of forwarding IPv6 traffic.
th: สร้าง tun link ที่สามารถส่งต่อข้อมูล IPv6

source: Ping remote over the TCP/UDP control channel if no packets have been sent for at least n seconds.
th: ปิงริโมตผ่านช่องควบคุม TCP/UDP ถ้าหากไม่มีแพ็กเก็็ตที่ส่งไปในเวลาวินาทีที่ตั้งไว้

source: Specify ping interval:
th: ตั้งค่าระยะเวลาปิง:

source: Exit or restart after n seconds pass without reception of a ping or other packet from remote.
th: ออกหรือเริ่มต้นใหม่หลังจากวินาทีที่ตั้งไว้ถ้าหากไม่ได้รับสัญญานปิงหรือแพ็กเก็ตอื่นจากริโมต

source: Specify exit or restart ping:
th: ตั้งค่าระยะเวลาออกหรือเริ่มต้นใหม่หลังจากการปิง:

source: ping-exit
th: ปิงออก

source: ping-restart
th: ปิงเริ่มใหม่

source: Allow remote peer to change its IP address and/or port number such as due to DHCP (this is the default if --remote is not used). --float when specified with --remote allows an OpenVPN session to initially connect to a peer at a known address, however if packets arrive from a new address and pass all authentication tests, the new address will take control of the session. This is useful when you are connecting to a peer which holds a dynamic address such as a dial-in user or DHCP client. Essentially, --float tells OpenVPN to accept authenticated packets from any address, not only the address which was specified in the --remote option.
th: อนุญาตให้เพียร์ริโมตเปลี่ยนที่อยู่ IP และ/หรือเลขพอร์ต อาจจะเป็นเพราะ DHCP (ตัวเลือกนี้คือค่าเริ่มต้นถ้าหากไม่ได้ตั้งค่า --remote) ถ้าหากตั้งค่า --float กับ --remote ในเวลาเดียวกันจะเป็นการอนุญาตให้เซสชัน OpenVPN เชื่อมต่อไปยังที่อยู่เพียร์ที่รู้จักในตอนแรก แต่ถ้าหากแพ็กเก็ตมาจากที่อยู่ใหม่และผ่านการตรวจสอบทุกอย่าง ที่อยู่ใหม่จะชับช่วงต่อแทน ที่อยู่เก่าจากเซสชันปัจจุบัน มีประโยชน์ต่อเมมื่อคุณกำลังเชื่อมต่อไปยังเพียร์ที่ใช้ที่อยู่ไม่คงที่ เช่นผู้ใช้ dial-in หรือไคลเอนต์ DHCP

source: Accept authenticated packets from any address (Float)
th: รับแพ็กเก็ตที่ตรวจสอบความถูกต้องแล้วจากที่อยู่ใดก็ได้ (Float)

source: Specify the maximum number of routes the server is allowed to specify.
th: ตั้งค่าจำนวนสูงสุดของเส้นทางที่เซิร์ฟเวอร์สามารถกำหนดได้

source: Specify max routes:
th: ตั้งค่าเส้นทางสูงสุด:

source: Security
th: ความปลอดภัย

source: Encrypt packets with cipher algorithm. The default is BF-CBC (Blowfish in Cipher Block Chaining mode).
th: เข้ารหัสแพ็กเก็ตโดยอัลกอริทึมต่าง ๆ ค่าเริ่มต้นคือ BF-CBC (Blowfish in Chipher Block Chaining mode)

source: Cipher:
th: การเข้ารหัส:

source: Obtaining available ciphers…
th: กำลังหาวิธีการเข้ารหัสที่ใช้ได้...

source: Set cipher key size to a custom value. If unspecified, it defaults to cipher-specific size.
th: ตั้งค่าขนาดกุญแจการเข้ารหัสให้เป็นค่าที่กำหนดเอง ถ้าไม่ได้ตั้งจะใช้ค่าเริ่มต้นของการเข้ารหัสนั้น ๆ

source: Use custom size of cipher key:
th: ใช้ขนาดกุญแจการเข้ารหัสที่กำหนดเอง:

source: Authenticate packets with HMAC using message digest algorithm. The default is SHA1.
th: ตรวจสอบความถูกต้องของแพ็กเก็ตโดยใช้ HMAC กับอัลกอริทึมแยกแยะข้อความ ค่าเริ่มต้นคือ SHA1

source: HMAC Authentication:
th: การตรวจสอบความถูกต้อง HMAC:

# like in use Default configuration
source: Default
th: ค่าเริ่มต้น

# like in None setting selected
source: None
th: ไม่มี

source: TLS Settings
th: การตั้งค่า TLS

source: Verify server certificate identification. When enabled, connection will only succeed if the server certificate matches some expected properties. Matching can either apply to the whole certificate subject (all the fields), or just the Common Name (CN field).
th: ยืนยันการตรวจสอบใบรับรองของเซิร์ฟเวอร์ เมื่อเปิดตัวเลือกนี้ การเชื่อมต่อจะสำเร็จถ้าหากใบรับรองเซิร์ฟเวอร์ตรงกับคุณสมบัติที่ตั้งไว้เท่านั้น

source: Server Certificate Check:
th: ตรวจสอบใบรับรองเซิร์ฟเวอร์:

source: Don't verify certificate identification
th: อย่ายืนยันการระบุตัวตนใบรับรอง

source: Verify whole subject exactly
th: ยืนยันทั้งหมดตรงเป๊ะ

source: Verify name exactly
th: ยืนยันชื่อตรงเป๊ะ

source: Verify name by prefix
th: ยืนยันชื่อโดยใช้คำหน้าชื่อ

source: Verify subject partially (legacy mode, strongly discouraged)
th: ยืนยันทั้งหมดเป็นส่วนหนึ่ง (โหมดโบราณ ไม่แนะนำเป็นอย่างมาก)

source: Subject or Common Name to verify server certificate information against.
th: รายการหรือชื่อที่จะใช้เป็นข้อมูลยืนยันใบรับรองเซิร์ฟเวอร์

source: Subject Match:
th: รายการที่ตรงกัน:

source: Connect only to servers whose certificate matches the given subject. Example: /CN=myvpn.company.com
th: เชื่อมต่อไปยังที่เซิร์ฟเวอร์ที่ใบรับรองตรงกับรายการที่ใส่มา เช่น /CN=myvpn.company.com

source: Require that peer certificate was signed with an explicit key usage and extended key usage based on RFC3280 TLS rules.
th: บังคับให้ใบรับรองเพียร์ต้องลงนามโดยกุญแจที่ระบุการใช้งานอย่างชัดเจนและระบุการใช้งาน อย่างเพิ่มเติมที่กำหมดไว้โดยกฏ TLS ใน RFC3280

source: Verify peer (server) certificate usage signature
th: ยืนยันการลงนามการใช้งานใบรับรองของเพียร์ (เซิร์ฟเวอร์)

source: Remote peer certificate TLS type:
th: ชนิดใบรับรอง TLS ของเพียร์ริโมต:

source: Server
th: เซิร์ฟเวอร์

source: Client
th: ไคลเอนต์

source: Require that peer certificate was signed with an explicit nsCertType designation.
th: บังคับให้ใบรับรองเพียร์ถูกลงนามโดยใบรับรองที่ระบุ nsCertType อย่างชัดเจน

source: Verify peer (server) certificate nsCertType designation
th: ยืนยันใบรับรองเพียร์ที่ระบุ nsCertType

source: Remote peer certificate nsCert designation:
th: ใบรับรองของเพียร์ริโมตที่ระบุ nsCert:

source: Add an additional layer of HMAC authentication.
th: เพิ่มการรับรองความถูกต้องแบบ HMAC อีกชั้น

source: Mode:
th: โหมด:

source: None
th: ไม่มี

source: Add an additional layer of HMAC authentication on top of the TLS control channel to protect against DoS attacks.
th: เพิ่มการรับรองความถูกต้องแบบ HMAC อีกชั้นบนช่องควบคุม TLS เพื่อที่จะป้องกันการโจมตี DoS

source: Key File:
th: ไฟล์กุญแจ:

source: Direction parameter for static key mode.
th: พารามิเตอร์ทิศทางสำหรับโหมดเข้ารหัสแบบกุญแจคงที่

source: Server (0)
th: เซิร์ฟเวอร์ (0)

source: Client (1)
th: ไคลเอนต์ (1)

source: Proxies
th: พร็อกซี

source: Proxy type: HTTP or SOCKS
th: ชนิดพร็อกซี: HTTP หรือ SOCKS

source: Proxy Type:
th: ชนิดพร็อกซี

source: Not Required
th: ไม่บังคับ

source: Select this option if your organization requires the use of a proxy server to access the Internet.
th: เลือกตัวเลือกนี้ถ้าองค์กรของคุณบังคับใช้เซิร์ฟเวอร์พร็อกซีเพื่อที่จะใช้งานอินเทอร์เน็ต

source: Connect to remote host through a proxy with this address.
th: เชื่อมต่อไปยังโฮสต์ริโมตผ่านพร็อกซีโดยใช้ที่อยู่นี้

source: Server Address:
th: ที่อยู่เซิร์ฟเวอร์:

source: Connect to remote host through a proxy with this port.
th: เชื่อมต่อไปยังโฮสต์ริโมตผ่านพร็อกซีโดยใช้พอร์ตนี้

source: Port:
th: พอร์ต:

source: HTTP/SOCKS proxy username passed to OpenVPN when prompted for it.
th: ชื่อผู้ใช้พร็อกซี HTTP/SOCKS ที่ส่งไปให้ OpenVPN เมื่อถูกขอ

source: Proxy Username:
th: ชื่อผู้ใช้พร็อกซี:

source: HTTP/SOCKS proxy password passed to OpenVPN when prompted for it.
th: รหัสผ่านพร็อกซี HTTP/SOCKS ที่ส่งไปให้ OpenVPN เมื่อถูกขอ

source: Proxy Password:
th: รหัสผพร็อกซี

source: Retry indefinitely on proxy errors. It simulates a SIGUSR1 reset.
th: ลองไปเรื่อย ๆ ถ้าหากพบข้อผิดพลาด ตัวเลือกนี้จำลองสัญญานเริ่มใหม่ SIGUSR1

source: Retry indefinitely when errors occur
th: ลองไปเรื่อย ๆ ไม่มีวันจบถ้าหากข้อผิดพลาด

# @title: window advanced openvpn properties
source: Advanced OpenVPN properties
th: การตั้งค่า OpenVPN ขั้นสูง

# @item:inlistbox Item added when OpenVPN cipher lookup failed
source: OpenVPN cipher lookup failed
th: การดูวิธีการเข้ารหัสของ OpenVPN ล้มเหลว

# @item::inlist Default openvpn cipher item
source: Default
th: ค่าเริ่มต้น

# @item:inlistbox Item added when OpenVPN cipher lookup failed
source: No OpenVPN ciphers found
th: ไม่เจอวิธีการเข้ารหัสของ OpenVPN

source: Key Password:
th: รหัสผ่านกุญแจ:

source: authenticator
th: ตัวรับรองความถูกต้อง

source: code
th: โค๊ต

source: token
th: โทเคน

source: one-time password
th: รหัสผ่านครั้งเดียว
